name: "CaffeNet"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 76
input_dim: 76
layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 3
  blobs_lr: 3
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 20
    kernel_size: 3
    weight_filler {
 type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
layers {
  name: "conv1_sub1"
  type: CONVOLUTION
  bottom: "conv1"
  top: "conv1_sub1"
  blobs_lr: 2
  blobs_lr: 3
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 20
    kernel_size: 3
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu1_sub1"
  type: RELU
  bottom: "conv1_sub1"
  top: "conv1_sub1"
}

layers {
  name: "conv1_sub2"
  type: CONVOLUTION
  bottom: "conv1_sub1"
  top: "conv1_sub2"
  blobs_lr: 2
  blobs_lr: 3
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 20
    kernel_size: 3
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu1_sub2"
  type: RELU
  bottom: "conv1_sub2"
  top: "conv1_sub2"
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "conv1_sub2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "pool1"
  top: "conv2"
  blobs_lr: 1.5
  blobs_lr: 3
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 3
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "conv2"
  top: "conv2"
}
layers {
  name: "conv2_sub1"
  type: CONVOLUTION
  bottom: "conv2"
  top: "conv2_sub1"
  blobs_lr: 1.5
  blobs_lr: 3
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu2_sub1"
  type: RELU
  bottom: "conv2_sub1"
  top: "conv2_sub1"
}

layers {
  name: "conv2_sub2"
  type: CONVOLUTION
  bottom: "conv2_sub1"
  top: "conv2_sub2"
  blobs_lr: 1.5
  blobs_lr: 3
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu2_sub2"
  type: RELU
  bottom: "conv2_sub2"
  top: "conv2_sub2"
}

layers {
  name: "conv2_sub3"
  type: CONVOLUTION
  bottom: "conv2_sub2"
  top: "conv2_sub3"
  blobs_lr: 1.5
  blobs_lr: 3
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu2_sub3"
  type: RELU
  bottom: "conv2_sub3"
  top: "conv2_sub3"
}

layers {
  name: "conv2_sub4"
  type: CONVOLUTION
  bottom: "conv2_sub3"
  top: "conv2_sub4"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu2_sub4"
  type: RELU
  bottom: "conv2_sub4"
  top: "conv2_sub4"
}







layers {
  name: "pool2"
  type: POOLING
  bottom: "conv2_sub4"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "pool2"
  top: "conv3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 48
    kernel_size: 3
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3"
  type: RELU
  bottom: "conv3"
  top: "conv3"
}

layers {
  name: "conv3_sub1"
  type: CONVOLUTION
  bottom: "conv3"
  top: "conv3_sub1"
  blobs_lr: 0.8
  blobs_lr: 1.5
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3_sub1"
  type: RELU
  bottom: "conv3_sub1"
  top: "conv3_sub1"
}

layers {
  name: "conv3_sub2"
  type: CONVOLUTION
  bottom: "conv3_sub1"
  top: "conv3_sub2"
  blobs_lr: 0.5
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3_sub2"
  type: RELU
  bottom: "conv3_sub2"
  top: "conv3_sub2"
}

layers {
  name: "conv3_sub3"
  type: CONVOLUTION
  bottom: "conv3_sub2"
  top: "conv3_sub3"
  blobs_lr: 0.5
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3_sub3"
  type: RELU
  bottom: "conv3_sub3"
  top: "conv3_sub3"
}


layers {
  name: "conv3_sub4"
  type: CONVOLUTION
  bottom: "conv3_sub3"
  top: "conv3_sub4"
  blobs_lr: 0.5
  blobs_lr: 1
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3_sub4"
  type: RELU
  bottom: "conv3_sub4"
  top: "conv3_sub4"
}



layers {
  name: "pool5"
  type: POOLING
  bottom: "conv3_sub4"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layers {
  name: "fc6"
  type: INNER_PRODUCT
  bottom: "pool5"
  top: "fc6"
  blobs_lr: 0.2
  blobs_lr: 0.4
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 512
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu6"
  type: RELU
  bottom: "fc6"
  top: "fc6"
}
layers {
  name: "drop6"
  type: DROPOUT
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}


layers {
  name: "fc8"
  type: INNER_PRODUCT
  bottom: "fc6"
  top: "fc8"
  blobs_lr: 0.2
  blobs_lr: 0.4
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 256
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value:0
    }
  }
}
layers {
  name: "relu8"
  type: RELU
  bottom: "fc8"
  top: "fc8"
}

layers {
  name: "fc9"
  type: INNER_PRODUCT
  bottom: "fc8"
  top: "fc9"
  blobs_lr: 0.1
  blobs_lr: 0.2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 128
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu9"
  type: RELU
  bottom: "fc9"
  top: "fc9"
}

layers {
  name: "fc8race"
  type: INNER_PRODUCT
  bottom: "fc9"
  top: "fc8race"
  blobs_lr: 0.1
  blobs_lr: 0.2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output:4
    weight_filler {
type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}

layers {
  name: "loss"
  type: SOFTMAX
  bottom: "fc8race"
  top: "loss"
}
